#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.aks-cluster.data.azurerm_log_analytics_workspace.log_workspace: Reading...
module.aks-cluster.data.azurerm_resource_group.main_group: Reading...
module.aks-cluster.data.azurerm_resource_group.main_group: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group]
module.aks-cluster.data.azurerm_virtual_network.virtual_network: Reading...
module.aks-cluster.data.azurerm_application_gateway.application_gateway: Reading...
module.aks-cluster.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network]
module.aks-cluster.data.azurerm_subnet.gateway_subnet: Reading...
module.aks-cluster.data.azurerm_subnet.k8s_subnet: Reading...
module.aks-cluster.data.azurerm_application_gateway.application_gateway: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/applicationGateways/fiap-tech-challenge-application-gateway]
module.aks-cluster.data.azurerm_log_analytics_workspace.log_workspace: Read complete after 1s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.OperationalInsights/workspaces/fiap-tech-challenge-observability-workspace]
module.aks-cluster.data.azurerm_subnet.gateway_subnet: Read complete after 1s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-gateway-subnet]
module.aks-cluster.data.azurerm_subnet.k8s_subnet: Read complete after 1s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-k8s-subnet]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.k8s will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "k8s" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + custom_ca_trust_certificates_base64              = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = "fiap-tech-challenge-cluster"
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "fiap-tech-challenge-k8s-group"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # module.aks-cluster.azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "sanduba-k8s"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "fiap-tech-challenge-cluster"
      + node_resource_group                 = "fiap-tech-challenge-k8s-node-group"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "fiap-tech-challenge-k8s-group"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "development"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-k8s-subnet"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/applicationGateways/fiap-tech-challenge-application-gateway"
          + ingress_application_gateway_identity = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.OperationalInsights/workspaces/fiap-tech-challenge-observability-workspace"
          + oms_agent_identity         = (known after apply)
        }
    }

  # module.aks-cluster.azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id         = (known after apply)
      + location   = "eastus"
      + managed_by = "fiap-tech-challenge-group"
      + name       = "fiap-tech-challenge-k8s-group"
      + tags       = {
          + "environment" = "development"
        }
    }

  # module.kubernetes-config.kubernetes_config_map.api_config will be created
  + resource "kubernetes_config_map" "api_config" {
      + data = {
          + "ASPNETCORE_ENVIRONMENT" = "Development"
          + "ASPNETCORE_URLS"        = "http://+:9000"
          + "AUTH_AUDIENCE"          = "Users"
          + "AUTH_ISSUER"            = "Sanduba.Auth"
          + "CART_CONNECTION_TYPE"   = "REDIS"
          + "MAIN_CONNECTION_TYPE"   = "MSSQL"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "api-config"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes-config.kubernetes_deployment.api_deployment will be created
  + resource "kubernetes_deployment" "api_deployment" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "sanduba-api-deployment"
            }
          + name             = "sanduba-api-deployment"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "sanduba-api-deployment"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "sanduba-api-deployment"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "cangelosilima/restaurantesanduba.api:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "restaurantesanduba-pod-api"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "ConnectionStrings__MainDatabase__Type"

                          + value_from {
                              + config_map_key_ref {
                                  + key  = "MAIN_CONNECTION_TYPE"
                                  + name = "api-config"
                                }
                            }
                        }
                      + env {
                          + name = "ConnectionStrings__MainDatabase__value"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "MAIN_CONNECTION_STRING"
                                  + name = "api-secrets"
                                }
                            }
                        }
                      + env {
                          + name = "ConnectionStrings__CartDatabase__Type"

                          + value_from {
                              + config_map_key_ref {
                                  + key  = "CART_CONNECTION_TYPE"
                                  + name = "api-config"
                                }
                            }
                        }
                      + env {
                          + name = "ConnectionStrings__CartDatabase_type"

                          + value_from {
                              + config_map_key_ref {
                                  + key  = "CART_CONNECTION_TYPE"
                                  + name = "api-config"
                                }
                            }
                        }
                      + env {
                          + name = "ConnectionStrings__CartDatabase__Value"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "CART_CONNECTION_STRING"
                                  + name = "api-secrets"
                                }
                            }
                        }
                      + env {
                          + name = "JwtSettings__SecretKey"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "AUTH_SECRET_KEY"
                                  + name = "api-secrets"
                                }
                            }
                        }
                      + env {
                          + name = "JwtSettings__Issuer"

                          + value_from {
                              + config_map_key_ref {
                                  + key  = "AUTH_ISSUER"
                                  + name = "api-config"
                                }
                            }
                        }
                      + env {
                          + name = "JwtSettings__Audience"

                          + value_from {
                              + config_map_key_ref {
                                  + key  = "AUTH_AUDIENCE"
                                  + name = "api-config"
                                }
                            }
                        }

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 60
                          + period_seconds        = 30
                          + success_threshold     = 1
                          + timeout_seconds       = 10

                          + http_get {
                              + path   = "/health"
                              + port   = "9000"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 9000
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "0.5"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "250m"
                              + "memory" = "50Mi"
                            }
                        }
                    }
                }
            }
        }
    }

  # module.kubernetes-config.kubernetes_ingress_v1.api_ingress will be created
  + resource "kubernetes_ingress_v1" "api_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "sanduba-api-ingress"
            }
          + name             = "sanduba-api-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "azure-application-gateway"

          + rule {
              + http {
                  + path {
                      + path      = "/*"
                      + path_type = "ImplementationSpecific"

                      + backend {
                          + service {
                              + name = "sanduba-api-svc"

                              + port {
                                  + number = 9000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.kubernetes-config.kubernetes_secret.api_secrets will be created
  + resource "kubernetes_secret" "api_secrets" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "api-secrets"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes-config.kubernetes_service.api_service will be created
  + resource "kubernetes_service" "api_service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + annotations      = {
              + "sevice.beta.kubernetes.io/azure-load-balancer-internal" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app" = "sanduba-api-svc"
            }
          + name             = "sanduba-api-svc"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "sanduba-api-deployment"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 9000
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
        }
    }

  # module.kubernetes-config.local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./kubeconfig"
      + id                   = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubeconfig_path = "/home/runner/work/tech-challenge-fiap-kubernetes-terraform/tech-challenge-fiap-kubernetes-terraform/kubeconfig"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cangelosilima, Action: `pull_request`*